#include "sysdef.h"
#ifndef 	FLASH_FIFO_H_H
#define 	FLASH_FIFO_H_H

typedef struct	 //这个数据内容写入flash中，作为队列的表头
{
	int bufferNum; 		//fifo内的数据块个数
	int inIndex;  	//入队数据的数据块索引	1---FLASH_INDEX_MAX
	int outIndex; 	//出队数据的数据块索引
	int	crc;	  	//数据块检验，防止写入出错
}FLASH_DATA; 


#define FLASHH_MAX_DATA_NUM	 	4000//最多可以存储的数据包数量
#define	FLASH_HEAD_PAGE			4050

/*******************************************************************************
 * 函数名称:initFlashFifo                                                                     
 * 描    述:初始化FLASH fifo的数据结构                                                                     
 *                                                                               
 * 输    入:rom fifo 的头结点                                                                     
 * 输    出:写入rom结果 1：成功 0：失败                                                                   
 * 返    回:无                                                                     
 * 作    者:蛋蛋                                                                     
 * 修改日期:2011年7月13日                                                                    
 *******************************************************************************/
u32	initFlashFifo(void);
/*******************************************************************************
 * 函数名称:writeFifoHead                                                                     
 * 描    述:将fifo head 写入rom                                                                     
 *                                                                               
 * 输    入:fifo head                                                                     
 * 输    出:写入rom结果 1：成功 0：失败                                                                     
 * 返    回:返回接收到的数据                                                                     
 * 作    者:蛋蛋                                                                     
 * 修改日期:2011年7月13日                                                                    
 *******************************************************************************/
u32		writeFifoHead(void);
/*******************************************************************************
 * 函数名称:IIC_ROM_ReceiveByte                                                                     
 * 描    述:接收一个字节                                                                     
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:返回接收到的数据                                                                     
 * 作    者:蛋蛋                                                                     
 * 修改日期:2011年7月13日                                                                    
 *******************************************************************************/
u32		getFifoHead(void);
/*******************************************************************************
 * 函数名称:IIC_ROM_ReceiveByte                                                                     
 * 描    述:接收一个字节                                                                     
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:返回接收到的数据                                                                     
 * 作    者:蛋蛋                                                                     
 * 修改日期:2011年7月13日                                                                    
 *******************************************************************************/
u32		getAddress(u32 index,u32 *address);
/*******************************************************************************
 * 函数名称:IIC_ROM_ReceiveByte                                                                     
 * 描    述:接收一个字节                                                                     
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:返回接收到的数据                                                                     
 * 作    者:蛋蛋                                                                     
 * 修改日期:2011年7月13日                                                                    
 *******************************************************************************/
u32		inFlashFifo(u8 *pointer,u32 length);
/*******************************************************************************
 * 函数名称:IIC_ROM_ReceiveByte                                                                     
 * 描    述:接收一个字节                                                                     
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:返回接收到的数据                                                                     
 * 作    者:蛋蛋                                                                     
 * 修改日期:2011年7月13日                                                                    
 *******************************************************************************/
u32		outFlashFifo(u8 *pointer,u32 length);

void	flashFifoTest(void);
void	writeFlashFifo(uint32_t,uint32_t *pointer,int length);
void	readFlashFifo(uint32_t,uint32_t *pointer,int length);


#endif

