#include "sysdef.h"

#ifndef RTC_H_H
#define RTC_H_H


typedef struct 
{
	int8_t week;
	int16_t year;

	int8_t month;
	int8_t date;
	int8_t hour;
	int8_t minute;
	int8_t second;
		
}TIME;

extern TIME timer;
/*******************************************************************************
 * 函数名称:rtcConfig                                                                     
 * 描    述:建立TCP连接                                                               
 *                                                                               
 * 输    入:建立连接的类型0：TCP 1：UDP                                                                    
 * 输    出:无                                                                    
 * 返    回:-1：发生错误 0：不存在指定的socket 1：找到指定socket                                                                    
 * 作    者:蛋蛋                                                                     
 * 修改日期:2012年3月9日                                                                    
 *******************************************************************************/
void rtcConfig(void);
/*******************************************************************************
 * 函数名称:getTime                                                                     
 * 描    述:建立TCP连接                                                               
 *                                                                               
 * 输    入:建立连接的类型0：TCP 1：UDP                                                                    
 * 输    出:无                                                                    
 * 返    回:-1：发生错误 0：不存在指定的socket 1：找到指定socket                                                                    
 * 作    者:蛋蛋                                                                     
 * 修改日期:2012年3月9日                                                                    
 *******************************************************************************/
void getTime(void);
/*******************************************************************************
 * 函数名称:setTime                                                                     
 * 描    述:建立TCP连接                                                               
 *                                                                               
 * 输    入:建立连接的类型0：TCP 1：UDP                                                                    
 * 输    出:无                                                                    
 * 返    回:-1：发生错误 0：不存在指定的socket 1：找到指定socket                                                                    
 * 作    者:蛋蛋                                                                     
 * 修改日期:2012年3月9日                                                                    
 *******************************************************************************/
void setTime(void);
int8_t RTC_Get_Week (int16_t year,int8_t month,int8_t day);
void rtcTest(void);







#endif 


